app/controllers/auctions_controller.rb

  def index
    @auctions = Auction.find(:all, :conditions => "end_time >= "+Time.new.to_i.to_s)
---
SELECT "auctions".* FROM "auctions" WHERE (end_time >= 1335235543)

  def show
    @auction = Auction.find(params[:id])
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @auction = Auction.find(params[:id])
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = ? LIMIT 1  [["id", "1"]]

  def bid
    @auction = Auction.find(params[:id])
    @auction.price += 1
    @auction.save()
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "auctions" SET "price" = 6, "updated_at" = '2012-04-21 17:57:47.239722' WHERE "auctions"."id" = 2

  def create
    @auction = Auction.new(params[:auction])
    @auction.end_time = Time.new.to_i + 3600*24 # Set end_time 24 hours ahead of now

    respond_to do |format|
      if @auction.save
---
INSERT INTO "auctions" ("created_at", "end_time", "listing_id", "price", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 24 Apr 2012 02:22:16 UTC +00:00], ["end_time", 1335320508], ["listing_id", 1], ["price", 0], ["updated_at", Tue, 24 Apr 2012 02:22:16 UTC +00:00], ["user_id", 0]]

  def update
    @auction = Auction.find(params[:id])

    respond_to do |format|
      if @auction.update_attributes(params[:auction])
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "auctions" SET "listing_id" = 1, "updated_at" = '2012-04-21 02:58:38.499441' WHERE "auctions"."id" = 1