app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("bids", "created_at", "id", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["bids", 0], ["created_at", Sat, 21 Apr 2012 16:49:42 UTC +00:00], ["id", 0], ["updated_at", Sat, 21 Apr 2012 16:49:42 UTC +00:00], ["username", "Nobody"]]

  def update
    respond_to do |format|
      if @user.update_attributes(params[:user])
---
UPDATE "users" SET "username" = 'John', "updated_at" = '2012-04-21 16:49:49.376123' WHERE "users"."id" = 1